
function ClearText(){
    // $("#srcText").val("").focus(); 
    var srcText = document.getElementById("srcText");
    srcText.value = "";
    srcText.focus();
}

function formatXS() {
    var body = "\n" + document.getElementById("srcText").value;
    body = body.replace(/[\r\n]+/g, "\n").replace(/^\n|\n$|\s+$|[ ]+|\t+/mg, "");
    body = body.replace(/<\/?a[^>]*>/ig, ""); //去除a
    body = body.replace(/<p>(&nbsp;|\s)*<\/p>/g, "");
    body = body.replace(/^\s*/gm, "　　");
    body = body.replace(/&nbsp;/g, "");
    document.getElementById("srcText").value = body;
}

function format() {
    var body = "\n" + document.getElementById("srcText").value;
    body = body.replace(/[\r\n]+/g, "\n").replace(/^\n|\n$|\s+$|[ ]+|\t+/mg, "");
    body = body.replace(/<\/?a[^>]*>/ig, ""); //去除a
    body = body.replace(/<p>(&nbsp;|\s)*<\/p>/g, "");
    body = body.replace(/^\s*/gm, "    ");
    body = body.replace(/&nbsp;/g, "");
    document.getElementById("srcText").value = body;
}

function formatjs() {
    var body = document.getElementById("srcText").value;
    body = body.replace(/<[^>].*?>/g, "");
    body = body.replace(/&nbsp;/g, "");
    document.getElementById("srcText").value = body;
}

function format3() {
    var body = "\n" + document.getElementById("srcText").value;
    //body = body.replace(/ |　/ig,"");
    body = body.replace(/\r\n/ig, "\n");
    body = body.replace(/\n\n/ig, "\n");
    body = body.replace(/\n\n/ig, "\n");
    body = body.replace(/\n\n/ig, "\n");
    body = body.replace(/\n\n/ig, "\n");
    body = body.replace(/\n/ig, "\n\n");
    body = body.replace("\n\n", "");
    document.getElementById("srcText").value = body;
}

function format4() {
    var body = document.getElementById("srcText").value;
    for (var ii = 0; 100 > ii; ii++) {
        body = body.replace("　", "");  //去除全角空格
        body = body.replace(",", "，");  //替换英文标点 
        body = body.replace("......", "……");
        body = body.replace("。。。。。。", "……");
        body = body.replace("?", "？");
        body = body.replace(".", "。");
        body = body.replace(";", "；");
        body = body.replace(":", "：");
        body = body.replace("!", "！");
        body = body.replace("(", "（");
        body = body.replace(")", "）");
        body = body.replace("----", "——");
        body = body.replace("--", "——");
        body = body.replace("[", "［");
        body = body.replace("]", "］");
    }
    document.getElementById("srcText").value = body;
}

function chklen() {
    var strlen;
    strlen = document.getElementById("srcText").value.length;
    JsonsMessageBox($("#srcText"), "目前共" + strlen + "文字");
    return;
}

function copy(ob) {
    var obj = findObj(ob); if (obj) {
        obj.select(); js = obj.createTextrange(); js.execCommand("Copy");
    }
}

function findObj(n, d) {
    var p, i, x; if (!d) d = document; if ((p = n.indexOf("?")) > 0 && parent.frames.length) {
        d = parent.frames[n.substring(p + 1)].document; n = n.substring(0, p);
    }
    if (!(x = d[n]) && d.all) x = d.all[n]; for (i = 0; !x && i < d.forms.length; i++) x = d.forms[i][n];
    for (i = 0; !x && d.layers && i < d.layers.length; i++) x = findObj(n, d.layers[i].document);
    if (!x && document.getElementById) x = document.getElementById(n); return x;
}

function CheckWords() {
    var n = 0;
    var rtval = "";
    var keys = "爱带|白晰|爆乱|报筹|暴炸|卑却|辩析|恶耗|材华|喝采|翱游|娘两|更叠|恰商|起迄|沾辱|中裁|雕彻|陷井|劈谣|明片|梦餍|缈视|募然|蓦捐|通辑|杂踏|奕棋|疏峻|吉详|肖象|开消|撕杀|膺品|贮立|绉纹|躁热|肿涨|羁靡|描模|遨翔|振撼|呕气|亵赎|恢谐|渲泄|宣染|延申|奢糜|毗临|骠悍|永决|欧打|座落|幅射|拥带|煤碳|编篡|按磨|爆躁|蜇居|下功夫|显象管|爆发户|造事者|纹身|座标系|照像机|暖哄哄|名信片|坐右铭|天然汽|煤汽管道|引伸义|雄纠纠|冷不妨|裨官野史|火山暴发|和霭可亲|爱不失手|爱乌及屋|安份守己|按居乐业|暗然泪下|黯无天日|敖敖待哺|飞扬拔扈|绝不罢休|白壁微瑕|英雄倍出|半途而费|哀声叹气|山洪爆发|武装爆动|五色斑澜|百步串杨|百尺杆头|罢绌百家|百战不贻|大有稗益|原物必还|森严壁磊|鞭僻入理|能言善辨|变本加利|变换莫测|骠肥体壮|标柄千古|别出心才|兵慌马乱|彬彬有理|涣然一新|摒气凝神|病入膏盲|并行不背|拨乱返正|军事布署|人所不耻|不共带天|不寒而立|不惶顾及|不记其数|不接不离|不加思索|不卑不吭|不径而走|继往不究|不堪之论|不可思异|不明一文|不求深解|宁死不曲|麻木不忍|不详之兆|步履维坚|雄材大略|材疏学浅|神采弈弈|材华横溢|兴高彩烈|张灯结采|惨绝人圜|灿然一笑|苍海桑田|沧茫大海|藏诟纳污|草官人命|测隐之心|成出不穷|层见迭出|层峦叠障|插科打浑|蝉连冠军|陈陈相应|陈词烂调|自学成才|惩前毙后|惩一禁百|吃里爬外|斥之以鼻|冲耳不闻|首当其充|忧心冲冲|山峦重迭|重整旗鼓|一愁莫展|出类拔粹|出奇不意|出人投地|除旧补新|处心集虑|穿流不息|传颂一时|吹毛求刺|从常计议|粗枝大意|粗制烂造|措火积薪|错手不及|大才小用|大放獗词|大声急呼|大廷广众|虎视耽耽|当人不让|倒打一把|得不尝失|得垄望蜀|地大物搏|掂斤拨两|草木雕零|凋虫小技|调以轻心|吊虎离山|迭挫强敌|迭床架屋|层峦迭障|动则得咎|以毒功毒|独挡一面|独劈蹊径|独占螯头|度过难关|疾贤妒能|堵绝浪费|断章取意|对针下药|两军对恃|绌绌逼人|恶灌满盈|发号司令|震聋发聩|令人发直|要言不繁|繁文溽节|易如翻掌|防患未燃|飞声文坛|成绩蜚然|缠绵悱测|妄自菲薄|非夷所思|纲纪废驰|费寝忘食|废尽心思|分道扬标|分庭抗理|纷至踏来|焚膏既晷|愤闷不平|愤笔急书|丰功伟迹|蜂涌而至|凤冠霞披|幅圆辽阔|浮光略影|斧底抽薪|付之东流|言简意该|甘败下风|改斜归正|甘之如怡|感恩带德|根深底固|工力悉抵|功亏一蒉|全神灌注|鬼斧神功|鬼域技俩|过尤不及|禁若寒蝉|含辛如苦|汗流夹背|合盘托出|合衷共济|轰堂大笑|后发治人|划地为牢|回光反照|独具惠眼|昏馈无能|浑浑恶恶|浑玉朴金|忽然开朗|祸国秧民|击浊扬清|嫉恶如仇|急言厉色|集液成裘|挤挤一堂|计日成功|肆无忌殚|既往开来|佳言懿行|艰壁清野|艰不可摧|坚忍不拔|历尽坚辛|坚难困苦|矫糅造作|接长补短|可资借戒|弱不经风|金榜提名|金壁辉煌|金刚努目|金钢钻头|决无仅有|挤身三强|精兵减政|精诚所致|居心不测|以警效尤|鸩形鹄面|举一返三|拒谏是非|一应具全|精神矍烁|赞不决口|峻工验收|开诚不公|开门缉盗|开天劈地|开源截流|开中明义|勘平叛乱|刻划人物|科头洗足|可望不可及|刻己奉公|刻勤刻俭|夸夸奇谈|宽弘大量|困兽尤斗|味同嚼腊|意兴阑姗|无耻滥言|烂竽充数|宁缺毋烂|老陈持重|老奸巨滑|其乐淘淘|雷历风行|礼上往来|理曲词穷|立杆见影|立功渎罪|厉精图治|励兵秣马|励行节约|厉厉在目|藕断丝联|连锁反映|横征暴殓|廖若晨星|一麟半爪|流览报纸|留恋忘返|老态龙肿|炉火成青|暂露头角|戳力同心|旅力过人|攻城掠地|沦肌夹髓|无与论比|轮功行赏|慢不经心|茫无头序|毛骨耸然|名列前矛|冒然从事|无精打彩|门里出生|门廷若市|朦懂无知|靡烂不堪|迷天大谎|欲盖弥彰|望风披糜|糜日不思|糜糜之音|天下糜然|密而不宣|祖传密方|沉缅往事|湎怀先烈|面面具到|虚无缥渺|死不冥目|瞑思苦想|薄暮冥冥|深明大意|明查暗访|名哲保身|磨肩擦背|磨崖石刻|顶礼模拜|穷途没路|莫明其妙|莫中一是|末齿不忘|谋取暴利|暮蔼沉沉|目不瑕接|令人目炫|脑羞成怒|能曲能伸|泥砂俱下|消声匿迹|弄巧成绌|盘根错结|判若洪沟|旁证博引|如法炮治|篷筚生辉|蓬头诟面|披星带月|披肝厉胆|披艰执锐|披沙捡金|披红带花|辟头盖脸|凭心而论|破斧沉舟|迫不急待|铺张扬利|朴朔迷离|出奇不意|文笔奇倔|气喘嘘嘘|气极败坏|气势凶凶|讫今为止|博识恰闻|斩将骞旗|千锤百练|千古一痛|前车之戒|深致欠意|强词夺礼|敲榨勒索|巧装打扮|巧夺天公|巧立明目|契而不舍|浸人心脾|轻歌慢舞|磬竹难书|穷兵渎武|穷原竞委|穷穷孑立|屈意逢迎|趋之若骛|曲打成招|雀巢鸠占|欢呼鹊跃|惹事生非|仁致义尽|色厉内忍|忍劳忍怨|融汇贯通|其乐溶溶|水乳交溶|春光溶溶|耳儒目染|儒子可教|如火如茶|如雷灌耳|如丧考比|入情入礼|大杀风景|脸色杀白|扇风点火|扇动|山青水秀|跚跚来迟|伤天害礼|爽心悦目|稍安毋躁|舍身取义|三令五伸|大现身手|伸东击西|生杀与夺|生死悠关|歌舞生平|胜况空前|稳操胜卷|拾遗补缺|拾人牙惠|试目以待|杀君夺位|持才傲物|世外桃园|誓不两立|势均力抵|势如爆竹|噬脐莫急|事得其反|收来人心|手屈一指|眼急手快|布衣疏食|毁家抒难|束手待毖|水利发电|水泻不通|烁石流金|各施其职|司空见怪|死心踏地|悚人听闻|追本朔源|素昧平身|随声附合|贪脏枉法|谈笑风声|昙花一显|坦胸露臂|叹为观之|长嘘短叹|富丽唐皇|桃梨满园|誉写文章|醍醐贯顶|提心掉胆|题纲挈领|天经地仪|天礼难容|婷婷玉立|挺而走险|通货膨涨|通情达礼|同等学历|异曲同功|痛心嫉首|偷工简料|投投是道|走头无路|图谋不规|图穷匕现|涂毒生灵|生灵涂碳|推崇倍至|推脱生病|推托责任|推心至腹|退化变质|屯积居奇|脱颍而出|歪风斜气|歪门斜道|完壁归赵|玩世不公|万古常青|万冠家财|万变不离其中|万籁具寂|妄费心机|置若惘闻|忘恩负意|忘夫所以|痴心枉想|望而怯步|名门旺族|望洋心叹|正襟威坐|危言悚听|危如磊卵|微言大意|为富不忍|运筹惟幄|委屈求全|委屈婉转|尾大不吊|不温不火|文恬武嘻|闻过饰非|有条不稳|协从不问|无人问斤|左右开工|作贼心虚|坐地分脏|坐想其成|坐以待毖|坐无虚席|暴烈恣睢|自立更生|自名得意|自食其利|自名不凡|纵横捭合|卓智多谋|飞机着落|谆谆告戒|抓耳扰腮|钟灵玉秀|奋斗终身|终生大事|仲栽委员|寡不抵众|不浮众望|口株笔伐|关怀倍至|珠连璧合|振济灾民|指手划脚|珍重其事|步入正规|知书达礼|直接了当|直言不晦|执谜不悟|表本兼治|治丝益纷|志大材疏|至理明言|专心至志|轶序井然|灸手可热|中流抵柱|震震有词|震奋人心|振笔急书|远见灼识|真知卓见|真象大白|浅尝则止|重重迭迭|作奸犯课|照本宣课|照然若揭|招惹事非|仗义输财|明火执杖|张惶失措|彰善惮恶|战战惊惊|斩钉接铁|玷玷自喜|玷亲带故|令人乍舌|口干舌躁|不骄不燥|再接再励|栽脏陷害|古今杂揉|陨身不恤|纭纭众生|越俎代包|沿木求鱼|圆林圆丁|圆地圆艺|语无论次|坐收鱼利|余勇可沽|宥于成见|估名钓誉|有口皆杯|耳根清静|怨天犹人|利害悠关|犹柔寡断|义气用事|始作踊者|涌跃报名|永往直前|永保青春|一涌而入|拥塞不通|壅荣华贵|庸庸录录|心心相应|影影约约|隐隐绰绰|引疚自责|饮鸠止渴|绿草如荫|因地治宜|因才施教|学习肆业|义无返顾|意正词严|义气风发|不郎不莠|受益非浅|词不达义|因噎费食|依仗权势|以老卖老|遗笑大方|遗害无穷|以逸代劳|以一挡十|贻然自得|毫无疑议|移花截木|不贻余力|一视同人|一如继往|一喏千金|一劳永易|一脉相成|一獗不振|一鼓足气|一盖而论|一促而就|一层不变|一笔钩销|钓消执照|弃甲拽兵|跃武扬威|沓无音信|指高气扬|扬扬洒洒|手急眼快|眼花撩乱|演译推理|延袭成规|严正申明|严阵以代|严惩不待|言不由中|和言悦色|淹没无闻|厌厌欲睡|殉情枉法|以身徇国|央央大国|不作为训|雪中送碳|器度不凡|喧然大波|千头万序|自我吹吁|诩诩如生|大相径廷|吁寒问暖|一泄千里|沆泄一气|心安礼得|别出新裁|心旷神饴|心劳日绌|猩猩作态|凶相必露|热涨冷缩|直抒胸意|修养生息|修茸一新|秀外惠中|扶老偕幼|白头携老|一望无银|不拘小结|风雨萧萧|积毁消骨|消遥法外|宵衣干食|响彻云宵|降龙服虎|安置若素|先理后兵|先发治人|下车一始|瑕迩闻名|相形见拙|相辅相承|丢人显眼|显身说法|细枝末结|喜出往外|畏崽不前|歇事宁人|作歇时间|流言非语|物极必返|除恶勿尽|五体头地|五彩斑烂|无泄可击|无细可乘|无所是从|无所不致|无是生非|无尚光荣|无艰不摧|无计于事|无计之谈|诛连无辜|无耻之犹|反来复去|翻复无常|乌烟脏气|污合之众|翁中捉鳖|翁声翁气|造谣装骗|胀红了脸|仗义直言|头昏脑胀|板上走丸|自曝自弃|民生凋蔽|投机捣把|趁心如意|墨守陈规|一张一驰|莫可明状|势不可挡|循规导矩|欢渡春节|三翻五次|入不付出|英雄气慨|一股作气|发扬广大|性格粗旷|行踪鬼秘|阴谋鬼计|精神焕散|模范事绩|情不自尽|前踞后恭|龙盘虎据|棵粒归仓|评头评足|身体嬴弱|大多类同|风声鹤戾|火中取粟|留连忘返|甘败下风|史无前列|风糜一时|个中三昧|沤心沥血|前扑后继|星罗旗布|沽恶不悛|杀费苦心|鬼鬼崇崇|按步就班|偃苗助长|记忆尤新|向偶而泣|大伤原气|改弦更章|丰富多采|渊远流长|众目暌暌|洗耳躬听|人心项背|万相更新|毋用讳言|支无其词|切搓琢磨|无忘之灾|不既不离|不醒人事|不言而语|不另赐教|世无前例|老声常谈|尽心极力|各行其事|言之足足|投鼠计器|形影相掉|淄铢必较|含蓄蕴籍|萎糜不振|声名雀起|人情事故|按装电话|一幅对联|天翻地复|一股作气|悬梁刺骨|食不果腹|震憾人心|一如继往|娇揉造作|一诺千斤|如期峻工|不落巢臼|烩炙人口|死皮癞脸|兰天白云|顶力相助|黄梁美梦|美仑美奂|蛛丝蚂迹|默守成规|浑浑恶恶|以偏盖全|有持无恐|九洲方圆|布署已定|愤发图强|残无人道|鞠躬尽粹|暗然销魂|惮精竭虑|皎皎者|辨证法|财物科|付食品|文诌诌|趁心如意|贯输知识|羽扇伦巾|沾污清白|发扬广大|民生凋蔽|横度长江|坠落腐化|明辩是非|磕磕拌拌|脉博微弱|曲高合寡|义不容词|浪废金钱|官运享通|声音宏亮|决对服从|轰堂大笑|尚待商确|无礼漫骂|富丽堂黄|心恢意懒|观磨教|学金殴无缺|临摩书法|供献巨大|如法泡制|少纵即逝|箴口不言|批沙拣金|风尘扑扑|事过景迁|精精业业|绿树成阴|学识休养|奇角之势|循序前进|安兵不动|挑肥捡瘦|别出新裁|鞠躬尽粹|错手不及|肺腹之言|如梗在喉|无讥之谈|愤世疾俗|浮想连翩|留芳百世|棉里藏针|名珠暗投|死不冥目|苦思瞑想|无是生非|各书己见|众口烁金|括不知耻|暴舔天物|按途索骥|应接不遐|循章摘句|桀傲不驯|察颜观色|万马齐暗|以身作责|闲情逸志|中心感谢|莫中一是|一见衷情|揣揣不安|摇摇欲堕|虚座以待|原形必露|远大报负|蓄意抱复|投桃抱李|以德抱怨|报怨不堪|深受蒙敝|蔽帚自珍|倍受欢迎|艰苦倍尝|良晨美景|璀烂夺目|神彩飞扬|风彩动人|保护国萃|带罪立功|连篇累椟|买牍还珠|穷兵渎武|老实本份|份内之事|反工重来|认罪服法"
    var key = keys.split('|');
    for (var i = 0; i < key.length; i++) {
        var rng = document.getElementById("srcText").value;
        if (rng.indexOf(key[i]) > 0) {
            if (n == 0)
                rtval = "发现可疑别字：" + key[i];
            else
                rtval = rtval + "，" + key[i];
            n++;
        }
    }
    if (n == 0) {
        JsonsMessageBox($("#srcText"), "没有发现可疑错别字");
    }
    else {
        JsonsMessageBox($("#srcText"), rtval);
    }
}

var s = "万与丑专业丛东丝丢两严丧个丬丰临为丽举么义乌乐乔习乡书买乱争于亏云亘亚产亩亲亵亸亿仅从仑仓仪们价众优伙会伛伞伟传伤伥伦伧伪伫体余佣佥侠侣侥侦侧侨侩侪侬俣俦俨俩俪俭债倾偬偻偾偿傥傧储傩儿兑兖党兰关兴兹养兽冁内冈册写军农冢冯冲决况冻净凄凉凌减凑凛几凤凫凭凯击凼凿刍划刘则刚创删别刬刭刽刿剀剂剐剑剥剧劝办务劢动励劲劳势勋勐勚匀匦匮区医华协单卖卢卤卧卫却卺厂厅历厉压厌厍厕厢厣厦厨厩厮县叁参叆叇双发变叙叠叶号叹叽吁后吓吕吗吣吨听启吴呒呓呕呖呗员呙呛呜咏咔咙咛咝咤咴咸哌响哑哒哓哔哕哗哙哜哝哟唛唝唠唡唢唣唤唿啧啬啭啮啰啴啸喷喽喾嗫嗬嗳嘘嘤嘱噜噼嚣嚯团园囱围囵国图圆圣圹场坂坏块坚坛坜坝坞坟坠垄垅垆垒垦垧垩垫垭垯垱垲垴埘埙埚埝埯堑堕塆塬墙壮声壳壶壸处备复够头夸夹夺奁奂奋奖奥妆妇妈妩妪妫姗姜娄娅娆娇娈娱娲娴婳婴婵婶媪嫒嫔嫱嬷孙学孪宁宝实宠审宪宫宽宾寝对寻导寿将尔尘尝尧尴尸尽层屃屉届属屡屦屿岁岂岖岗岘岙岚岛岭岳岽岿峃峄峡峣峤峥峦崂崃崄崭嵘嵚嵛嵝嵴巅巩巯币帅师帏帐帘帜带帧帮帱帻帼幂幞干并幺广庄庆庐庑库应庙庞废庼廪开异弃张弥弪弯弹强归当录彟彦彻径徕御忆忏忧忾怀态怂怃怄怅怆怜总怼怿恋恳恶恸恹恺恻恼恽悦悫悬悭悯惊惧惨惩惫惬惭惮惯愍愠愤愦愿慑慭憷懑懒懔戆戋戏戗战戬户扎扑扦执扩扪扫扬扰抚抛抟抠抡抢护报担拟拢拣拥拦拧拨择挂挚挛挜挝挞挟挠挡挢挣挤挥挦捞损捡换捣据捻掳掴掷掸掺掼揸揽揿搀搁搂搅携摄摅摆摇摈摊撄撑撵撷撸撺擞攒敌敛数斋斓斗斩断无旧时旷旸昙昼昽显晋晒晓晔晕晖暂暧札术朴机杀杂权条来杨杩杰极构枞枢枣枥枧枨枪枫枭柜柠柽栀栅标栈栉栊栋栌栎栏树栖样栾桊桠桡桢档桤桥桦桧桨桩梦梼梾检棂椁椟椠椤椭楼榄榇榈榉槚槛槟槠横樯樱橥橱橹橼檐檩欢欤欧歼殁殇残殒殓殚殡殴毁毂毕毙毡毵氇气氢氩氲汇汉污汤汹沓沟没沣沤沥沦沧沨沩沪沵泞泪泶泷泸泺泻泼泽泾洁洒洼浃浅浆浇浈浉浊测浍济浏浐浑浒浓浔浕涂涌涛涝涞涟涠涡涢涣涤润涧涨涩淀渊渌渍渎渐渑渔渖渗温游湾湿溃溅溆溇滗滚滞滟滠满滢滤滥滦滨滩滪漤潆潇潋潍潜潴澜濑濒灏灭灯灵灾灿炀炉炖炜炝点炼炽烁烂烃烛烟烦烧烨烩烫烬热焕焖焘煅煳煺熘爱爷牍牦牵牺犊犟犭状犷犸犹狈狍狝狞独狭狮狯狰狱狲猃猎猕猡猪猫猬献獭玑玙玚玛玮环现玱玺珉珏珐珑珰珲琎琏琐琼瑶瑷璇璎瓒瓮瓯电画畅畲畴疖疗疟疠疡疬疮疯疱疴痈痉痒痖痨痪痫痴瘅瘆瘗瘘瘪瘫瘾瘿癞癣癫癯皑皱皲盏盐监盖盗盘眍眦眬着睁睐睑瞒瞩矫矶矾矿砀码砖砗砚砜砺砻砾础硁硅硕硖硗硙硚确硷碍碛碜碱碹磙礼祎祢祯祷祸禀禄禅离秃秆种积称秽秾稆税稣稳穑穷窃窍窑窜窝窥窦窭竖竞笃笋笔笕笺笼笾筑筚筛筜筝筹签简箓箦箧箨箩箪箫篑篓篮篱簖籁籴类籼粜粝粤粪粮糁糇紧絷纟纠纡红纣纤纥约级纨纩纪纫纬纭纮纯纰纱纲纳纴纵纶纷纸纹纺纻纼纽纾线绀绁绂练组绅细织终绉绊绋绌绍绎经绐绑绒结绔绕绖绗绘给绚绛络绝绞统绠绡绢绣绤绥绦继绨绩绪绫绬续绮绯绰绱绲绳维绵绶绷绸绹绺绻综绽绾绿缀缁缂缃缄缅缆缇缈缉缊缋缌缍缎缏缐缑缒缓缔缕编缗缘缙缚缛缜缝缞缟缠缡缢缣缤缥缦缧缨缩缪缫缬缭缮缯缰缱缲缳缴缵罂网罗罚罢罴羁羟羡翘翙翚耢耧耸耻聂聋职聍联聩聪肃肠肤肷肾肿胀胁胆胜胧胨胪胫胶脉脍脏脐脑脓脔脚脱脶脸腊腌腘腭腻腼腽腾膑臜舆舣舰舱舻艰艳艹艺节芈芗芜芦苁苇苈苋苌苍苎苏苘苹茎茏茑茔茕茧荆荐荙荚荛荜荞荟荠荡荣荤荥荦荧荨荩荪荫荬荭荮药莅莜莱莲莳莴莶获莸莹莺莼萚萝萤营萦萧萨葱蒇蒉蒋蒌蓝蓟蓠蓣蓥蓦蔷蔹蔺蔼蕲蕴薮藁藓虏虑虚虫虬虮虽虾虿蚀蚁蚂蚕蚝蚬蛊蛎蛏蛮蛰蛱蛲蛳蛴蜕蜗蜡蝇蝈蝉蝎蝼蝾螀螨蟏衅衔补衬衮袄袅袆袜袭袯装裆裈裢裣裤裥褛褴襁襕见观觃规觅视觇览觉觊觋觌觍觎觏觐觑觞触觯詟誉誊讠计订讣认讥讦讧讨让讪讫训议讯记讱讲讳讴讵讶讷许讹论讻讼讽设访诀证诂诃评诅识诇诈诉诊诋诌词诎诏诐译诒诓诔试诖诗诘诙诚诛诜话诞诟诠诡询诣诤该详诧诨诩诪诫诬语诮误诰诱诲诳说诵诶请诸诹诺读诼诽课诿谀谁谂调谄谅谆谇谈谊谋谌谍谎谏谐谑谒谓谔谕谖谗谘谙谚谛谜谝谞谟谠谡谢谣谤谥谦谧谨谩谪谫谬谭谮谯谰谱谲谳谴谵谶谷豮贝贞负贠贡财责贤败账货质贩贪贫贬购贮贯贰贱贲贳贴贵贶贷贸费贺贻贼贽贾贿赀赁赂赃资赅赆赇赈赉赊赋赌赍赎赏赐赑赒赓赔赕赖赗赘赙赚赛赜赝赞赟赠赡赢赣赪赵赶趋趱趸跃跄跖跞践跶跷跸跹跻踊踌踪踬踯蹑蹒蹰蹿躏躜躯车轧轨轩轪轫转轭轮软轰轱轲轳轴轵轶轷轸轹轺轻轼载轾轿辀辁辂较辄辅辆辇辈辉辊辋辌辍辎辏辐辑辒输辔辕辖辗辘辙辚辞辩辫边辽达迁过迈运还这进远违连迟迩迳迹适选逊递逦逻遗遥邓邝邬邮邹邺邻郁郄郏郐郑郓郦郧郸酝酦酱酽酾酿释里鉅鉴銮錾钆钇针钉钊钋钌钍钎钏钐钑钒钓钔钕钖钗钘钙钚钛钝钞钟钠钡钢钣钤钥钦钧钨钩钪钫钬钭钮钯钰钱钲钳钴钵钶钷钸钹钺钻钼钽钾钿铀铁铂铃铄铅铆铈铉铊铋铌铍铎铏铐铑铒铓铔铕铖铗铘铙铚铛铜铝铞铟铠铡铢铣铤铥铦铧铨铩铪铫铬铭铮铯铰铱铲铳铴铵银铷铸铹铺铻铼铽链铿销锁锂锃锄锅锆锇锈锉锊锋锌锍锎锏锐锑锒锓锔锕锖锗锘错锚锛锜锝锞锟锠锡锢锣锤锥锦锧锨锩锪锫锬锭键锯锰锱锲锳锴锵锶锷锸锹锺锻锼锽锾锿镀镁镂镃镄镅镆镇镈镉镊镋镌镍镎镏镐镑镒镓镔镕镖镗镘镙镚镛镜镝镞镟镠镡镢镣镤镥镦镧镨镩镪镫镬镭镮镯镰镱镲镳镴镵镶长门闩闪闫闬闭问闯闰闱闲闳间闵闶闷闸闹闺闻闼闽闾闿阀阁阂阃阄阅阆阇阈阉阊阋阌阍阎阏阐阑阒阓阔阕阖阗阘阙阚阛队阳阴阵阶际陆陇陈陉陕陧陨险随隐隶隽难雏雠雳雾霁霉霭靓静靥鞑鞒鞯鞴韦韧韨韩韪韫韬韵页顶顷顸项顺须顼顽顾顿颀颁颂颃预颅领颇颈颉颊颋颌颍颎颏颐频颒颓颔颕颖颗题颙颚颛颜额颞颟颠颡颢颣颤颥颦颧风飏飐飑飒飓飔飕飖飗飘飙飚飞飨餍饤饥饦饧饨饩饪饫饬饭饮饯饰饱饲饳饴饵饶饷饸饹饺饻饼饽饾饿馀馁馂馃馄馅馆馇馈馉馊馋馌馍馎馏馐馑馒馓馔馕马驭驮驯驰驱驲驳驴驵驶驷驸驹驺驻驼驽驾驿骀骁骂骃骄骅骆骇骈骉骊骋验骍骎骏骐骑骒骓骔骕骖骗骘骙骚骛骜骝骞骟骠骡骢骣骤骥骦骧髅髋髌鬓魇魉鱼鱽鱾鱿鲀鲁鲂鲄鲅鲆鲇鲈鲉鲊鲋鲌鲍鲎鲏鲐鲑鲒鲓鲔鲕鲖鲗鲘鲙鲚鲛鲜鲝鲞鲟鲠鲡鲢鲣鲤鲥鲦鲧鲨鲩鲪鲫鲬鲭鲮鲯鲰鲱鲲鲳鲴鲵鲶鲷鲸鲹鲺鲻鲼鲽鲾鲿鳀鳁鳂鳃鳄鳅鳆鳇鳈鳉鳊鳋鳌鳍鳎鳏鳐鳑鳒鳓鳔鳕鳖鳗鳘鳙鳛鳜鳝鳞鳟鳠鳡鳢鳣鸟鸠鸡鸢鸣鸤鸥鸦鸧鸨鸩鸪鸫鸬鸭鸮鸯鸰鸱鸲鸳鸴鸵鸶鸷鸸鸹鸺鸻鸼鸽鸾鸿鹀鹁鹂鹃鹄鹅鹆鹇鹈鹉鹊鹋鹌鹍鹎鹏鹐鹑鹒鹓鹔鹕鹖鹗鹘鹙鹚鹛鹜鹝鹞鹟鹠鹡鹢鹣鹤鹥鹦鹧鹨鹩鹪鹫鹬鹭鹯鹰鹱鹲鹳鹴鹾麦麸黄黉黡黩黪黾鼋鼌鼍鼗鼹齄齐齑齿龀龁龂龃龄龅龆龇龈龉龊龋龌龙龚龛龟";
var t = "萬與醜專業叢東絲丟兩嚴喪個爿豐臨為麗舉麼義烏樂喬習鄉書買亂爭於虧雲亙亞產畝親褻嚲億僅從侖倉儀們價眾優夥會傴傘偉傳傷倀倫傖偽佇體餘傭僉俠侶僥偵側僑儈儕儂俁儔儼倆儷儉債傾傯僂僨償儻儐儲儺兒兌兗黨蘭關興茲養獸囅內岡冊寫軍農塚馮沖決況凍淨淒涼淩減湊凜幾鳳鳧憑凱擊氹鑿芻劃劉則剛創刪別剗剄劊劌剴劑剮劍剝劇勸辦務勱動勵勁勞勢勳猛勩勻匭匱區醫華協單賣盧鹵臥衛卻巹廠廳曆厲壓厭厙廁廂厴廈廚廄廝縣三參靉靆雙發變敘疊葉號歎嘰籲後嚇呂嗎唚噸聽啟吳嘸囈嘔嚦唄員咼嗆嗚詠哢嚨嚀噝吒噅鹹呱響啞噠嘵嗶噦嘩噲嚌噥喲嘜嗊嘮啢嗩唕喚呼嘖嗇囀齧囉嘽嘯噴嘍嚳囁呵噯噓嚶囑嚕劈囂謔團園囪圍圇國圖圓聖壙場阪壞塊堅壇壢壩塢墳墜壟壟壚壘墾坰堊墊埡墶壋塏堖塒塤堝墊垵塹墮壪原牆壯聲殼壺壼處備複夠頭誇夾奪奩奐奮獎奧妝婦媽嫵嫗媯姍薑婁婭嬈嬌孌娛媧嫻嫿嬰嬋嬸媼嬡嬪嬙嬤孫學孿寧寶實寵審憲宮寬賓寢對尋導壽將爾塵嘗堯尷屍盡層屭屜屆屬屢屨嶼歲豈嶇崗峴嶴嵐島嶺嶽崠巋嶨嶧峽嶢嶠崢巒嶗崍嶮嶄嶸嶔崳嶁脊巔鞏巰幣帥師幃帳簾幟帶幀幫幬幘幗冪襆幹並么廣莊慶廬廡庫應廟龐廢廎廩開異棄張彌弳彎彈強歸當錄彠彥徹徑徠禦憶懺憂愾懷態慫憮慪悵愴憐總懟懌戀懇惡慟懨愷惻惱惲悅愨懸慳憫驚懼慘懲憊愜慚憚慣湣慍憤憒願懾憖怵懣懶懍戇戔戲戧戰戩戶紮撲扡執擴捫掃揚擾撫拋摶摳掄搶護報擔擬攏揀擁攔擰撥擇掛摯攣掗撾撻挾撓擋撟掙擠揮撏撈損撿換搗據撚擄摑擲撣摻摜摣攬撳攙擱摟攪攜攝攄擺搖擯攤攖撐攆擷擼攛擻攢敵斂數齋斕鬥斬斷無舊時曠暘曇晝曨顯晉曬曉曄暈暉暫曖劄術樸機殺雜權條來楊榪傑極構樅樞棗櫪梘棖槍楓梟櫃檸檉梔柵標棧櫛櫳棟櫨櫟欄樹棲樣欒棬椏橈楨檔榿橋樺檜槳樁夢檮棶檢欞槨櫝槧欏橢樓欖櫬櫚櫸檟檻檳櫧橫檣櫻櫫櫥櫓櫞簷檁歡歟歐殲歿殤殘殞殮殫殯毆毀轂畢斃氈毿氌氣氫氬氳彙漢汙湯洶遝溝沒灃漚瀝淪滄渢溈滬濔濘淚澩瀧瀘濼瀉潑澤涇潔灑窪浹淺漿澆湞溮濁測澮濟瀏滻渾滸濃潯濜塗湧濤澇淶漣潿渦溳渙滌潤澗漲澀澱淵淥漬瀆漸澠漁瀋滲溫遊灣濕潰濺漵漊潷滾滯灩灄滿瀅濾濫灤濱灘澦濫瀠瀟瀲濰潛瀦瀾瀨瀕灝滅燈靈災燦煬爐燉煒熗點煉熾爍爛烴燭煙煩燒燁燴燙燼熱煥燜燾煆糊退溜愛爺牘犛牽犧犢強犬狀獷獁猶狽麅獮獰獨狹獅獪猙獄猻獫獵獼玀豬貓蝟獻獺璣璵瑒瑪瑋環現瑲璽瑉玨琺瓏璫琿璡璉瑣瓊瑤璦璿瓔瓚甕甌電畫暢佘疇癤療瘧癘瘍鬁瘡瘋皰屙癰痙癢瘂癆瘓癇癡癉瘮瘞瘺癟癱癮癭癩癬癲臒皚皺皸盞鹽監蓋盜盤瞘眥矓著睜睞瞼瞞矚矯磯礬礦碭碼磚硨硯碸礪礱礫礎硜矽碩硤磽磑礄確鹼礙磧磣堿镟滾禮禕禰禎禱禍稟祿禪離禿稈種積稱穢穠穭稅穌穩穡窮竊竅窯竄窩窺竇窶豎競篤筍筆筧箋籠籩築篳篩簹箏籌簽簡籙簀篋籜籮簞簫簣簍籃籬籪籟糴類秈糶糲粵糞糧糝餱緊縶糸糾紆紅紂纖紇約級紈纊紀紉緯紜紘純紕紗綱納紝縱綸紛紙紋紡紵紖紐紓線紺絏紱練組紳細織終縐絆紼絀紹繹經紿綁絨結絝繞絰絎繪給絢絳絡絕絞統綆綃絹繡綌綏絛繼綈績緒綾緓續綺緋綽緔緄繩維綿綬繃綢綯綹綣綜綻綰綠綴緇緙緗緘緬纜緹緲緝縕繢緦綞緞緶線緱縋緩締縷編緡緣縉縛縟縝縫縗縞纏縭縊縑繽縹縵縲纓縮繆繅纈繚繕繒韁繾繰繯繳纘罌網羅罰罷羆羈羥羨翹翽翬耮耬聳恥聶聾職聹聯聵聰肅腸膚膁腎腫脹脅膽勝朧腖臚脛膠脈膾髒臍腦膿臠腳脫腡臉臘醃膕齶膩靦膃騰臏臢輿艤艦艙艫艱豔艸藝節羋薌蕪蘆蓯葦藶莧萇蒼苧蘇檾蘋莖蘢蔦塋煢繭荊薦薘莢蕘蓽蕎薈薺蕩榮葷滎犖熒蕁藎蓀蔭蕒葒葤藥蒞蓧萊蓮蒔萵薟獲蕕瑩鶯蓴蘀蘿螢營縈蕭薩蔥蕆蕢蔣蔞藍薊蘺蕷鎣驀薔蘞藺藹蘄蘊藪槁蘚虜慮虛蟲虯蟣雖蝦蠆蝕蟻螞蠶蠔蜆蠱蠣蟶蠻蟄蛺蟯螄蠐蛻蝸蠟蠅蟈蟬蠍螻蠑螿蟎蠨釁銜補襯袞襖嫋褘襪襲襏裝襠褌褳襝褲襇褸襤繈襴見觀覎規覓視覘覽覺覬覡覿覥覦覯覲覷觴觸觶讋譽謄訁計訂訃認譏訐訌討讓訕訖訓議訊記訒講諱謳詎訝訥許訛論訩訟諷設訪訣證詁訶評詛識詗詐訴診詆謅詞詘詔詖譯詒誆誄試詿詩詰詼誠誅詵話誕詬詮詭詢詣諍該詳詫諢詡譸誡誣語誚誤誥誘誨誑說誦誒請諸諏諾讀諑誹課諉諛誰諗調諂諒諄誶談誼謀諶諜謊諫諧謔謁謂諤諭諼讒諮諳諺諦謎諞諝謨讜謖謝謠謗諡謙謐謹謾謫譾謬譚譖譙讕譜譎讞譴譫讖穀豶貝貞負貟貢財責賢敗賬貨質販貪貧貶購貯貫貳賤賁貰貼貴貺貸貿費賀貽賊贄賈賄貲賃賂贓資賅贐賕賑賚賒賦賭齎贖賞賜贔賙賡賠賧賴賵贅賻賺賽賾贗贊贇贈贍贏贛赬趙趕趨趲躉躍蹌蹠躒踐躂蹺蹕躚躋踴躊蹤躓躑躡蹣躕躥躪躦軀車軋軌軒軑軔轉軛輪軟轟軲軻轤軸軹軼軤軫轢軺輕軾載輊轎輈輇輅較輒輔輛輦輩輝輥輞輬輟輜輳輻輯轀輸轡轅轄輾轆轍轔辭辯辮邊遼達遷過邁運還這進遠違連遲邇逕跡適選遜遞邐邏遺遙鄧鄺鄔郵鄒鄴鄰鬱郤郟鄶鄭鄆酈鄖鄲醞醱醬釅釃釀釋裏钜鑒鑾鏨釓釔針釘釗釙釕釷釺釧釤鈒釩釣鍆釹鍚釵鈃鈣鈈鈦鈍鈔鍾鈉鋇鋼鈑鈐鑰欽鈞鎢鉤鈧鈁鈥鈄鈕鈀鈺錢鉦鉗鈷缽鈳鉕鈽鈸鉞鑽鉬鉭鉀鈿鈾鐵鉑鈴鑠鉛鉚鈰鉉鉈鉍鈮鈹鐸鉶銬銠鉺鋩錏銪鋮鋏鋣鐃銍鐺銅鋁銱銦鎧鍘銖銑鋌銩銛鏵銓鎩鉿銚鉻銘錚銫鉸銥鏟銃鐋銨銀銣鑄鐒鋪鋙錸鋱鏈鏗銷鎖鋰鋥鋤鍋鋯鋨鏽銼鋝鋒鋅鋶鐦鐧銳銻鋃鋟鋦錒錆鍺鍩錯錨錛錡鍀錁錕錩錫錮鑼錘錐錦鑕鍁錈鍃錇錟錠鍵鋸錳錙鍥鍈鍇鏘鍶鍔鍤鍬鍾鍛鎪鍠鍰鎄鍍鎂鏤鎡鐨鎇鏌鎮鎛鎘鑷钂鐫鎳鎿鎦鎬鎊鎰鎵鑌鎔鏢鏜鏝鏍鏰鏞鏡鏑鏃鏇鏐鐔钁鐐鏷鑥鐓鑭鐠鑹鏹鐙鑊鐳鐶鐲鐮鐿鑔鑣鑞鑱鑲長門閂閃閆閈閉問闖閏闈閑閎間閔閌悶閘鬧閨聞闥閩閭闓閥閣閡閫鬮閱閬闍閾閹閶鬩閿閽閻閼闡闌闃闠闊闋闔闐闒闕闞闤隊陽陰陣階際陸隴陳陘陝隉隕險隨隱隸雋難雛讎靂霧霽黴靄靚靜靨韃鞽韉韝韋韌韍韓韙韞韜韻頁頂頃頇項順須頊頑顧頓頎頒頌頏預顱領頗頸頡頰頲頜潁熲頦頤頻頮頹頷頴穎顆題顒顎顓顏額顳顢顛顙顥纇顫顬顰顴風颺颭颮颯颶颸颼颻飀飄飆飆飛饗饜飣饑飥餳飩餼飪飫飭飯飲餞飾飽飼飿飴餌饒餉餄餎餃餏餅餑餖餓餘餒餕餜餛餡館餷饋餶餿饞饁饃餺餾饈饉饅饊饌饢馬馭馱馴馳驅馹駁驢駔駛駟駙駒騶駐駝駑駕驛駘驍罵駰驕驊駱駭駢驫驪騁驗騂駸駿騏騎騍騅騌驌驂騙騭騤騷騖驁騮騫騸驃騾驄驏驟驥驦驤髏髖髕鬢魘魎魚魛魢魷魨魯魴魺鮁鮃鯰鱸鮋鮓鮒鮊鮑鱟鮍鮐鮭鮚鮳鮪鮞鮦鰂鮜鱠鱭鮫鮮鮺鯗鱘鯁鱺鰱鰹鯉鰣鰷鯀鯊鯇鮶鯽鯒鯖鯪鯕鯫鯡鯤鯧鯝鯢鯰鯛鯨鯵鯴鯔鱝鰈鰏鱨鯷鰮鰃鰓鱷鰍鰒鰉鰁鱂鯿鰠鼇鰭鰨鰥鰩鰟鰜鰳鰾鱈鱉鰻鰵鱅鰼鱖鱔鱗鱒鱯鱤鱧鱣鳥鳩雞鳶鳴鳲鷗鴉鶬鴇鴆鴣鶇鸕鴨鴞鴦鴒鴟鴝鴛鴬鴕鷥鷙鴯鴰鵂鴴鵃鴿鸞鴻鵐鵓鸝鵑鵠鵝鵒鷳鵜鵡鵲鶓鵪鶤鵯鵬鵮鶉鶊鵷鷫鶘鶡鶚鶻鶖鶿鶥鶩鷊鷂鶲鶹鶺鷁鶼鶴鷖鸚鷓鷚鷯鷦鷲鷸鷺鸇鷹鸌鸏鸛鸘鹺麥麩黃黌黶黷黲黽黿鼂鼉鞀鼴齇齊齏齒齔齕齗齟齡齙齠齜齦齬齪齲齷龍龔龕龜";
function j2f() {
    var k = '';
    var buttonj2f = document.getElementById("buttonj2f");
    var str = document.getElementById("srcText").value;
    if (buttonj2f.value == '简->繁') {
        for (var i = 0; i < str.length; i++) k += (s.indexOf(str.charAt(i)) == -1) ? str.charAt(i) : t.charAt(s.indexOf(str.charAt(i)));
        buttonj2f.value = '繁->简';
    }
    else {
        for (var i = 0; i < str.length; i++) k += (t.indexOf(str.charAt(i)) == -1) ? str.charAt(i) : s.charAt(t.indexOf(str.charAt(i)));
        buttonj2f.value = '简->繁';
    }
    document.getElementById("srcText").value = k;
}